export const posters = [
  {
    image:
      "https://www.themoviedb.org/t/p/original/bX2xnavhMYjWDoZp1VM6VnU1xwe.jpg",
    row: 1,
    col: 4,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/original/aWh8R6jeAbmiB4TsF6CjYFrUsI8.jpg",
    row: 1,
    col: 7,
  },

  {
    image:
      "https://www.themoviedb.org/t/p/w220_and_h330_face/3Tf8vXykYhzHdT0BtsYTp570JGQ.jpg",
    row: 2,
    col: 2,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/original/zxVEkxgreRkFkh1rBK85T2JyxFY.jpg",
    row: 2,
    col: 6,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/original/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
    row: 3,
    col: 1,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/w220_and_h330_face/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
    row: 3,
    col: 3,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/original/vKEBse3BPU7crfAjdPNaC6WePnO.jpg",
    row: 3,
    col: 8,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/w220_and_h330_face/mfnkSeeVOBVheuyn2lo4tfmOPQb.jpg",
    row: 4,
    col: 2,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/w220_and_h330_face/bCj4EfuehAlgBwVd3diyWyhuuau.jpg",
    row: 4,
    col: 6,
  },
  {
    image:
      "https://www.themoviedb.org/t/p/original/i0enkzsL5dPeneWnjl1fCWm6L7k.jpg",
    row: 4,
    col: 8,
  },
];

export const list = [
  {
    screenplay: "Philippa Boyens / Fran Walsh",
    name: "指环王",
    year: "2001",
    director: "Peter Jackson",
    desc: "一位名叫弗拉多·巴金斯的年轻人，无意中得到了一枚魔戒。 这只戒指拥有无穷的神秘力量，戒指原来是黑暗君王索隆所有的，却意外地到了弗拉多手里。弗拉多决定将戒指摧毁，以免索隆夺回去巩固自己的势力。索隆为了阻止弗拉多，于是派出了手下的奥克斯加以追杀，一场正邪大战眼看着一触即发",
  },
  {
    screenplay: "Francis Ford Coppola / Mario Puzo",
    name: "教父",
    year: "1972",
    director: "Francis Ford Coppola",
    desc: "40年代的美国，“教父”维托·唐·柯里昂是黑手党柯里昂家族的首领，带领家族从事非法的勾当，但同时他也是许多弱小平民的保护神，深得人们爱戴。因为拒绝了毒枭索洛索的毒品交易要求，柯里昂家族和纽约其他几个黑手党家族的矛盾激化、圣诞前夕，索洛索劫持了“教父”的参谋汤姆，并派人暗杀“教父”；因为内奸的出卖，“教父”的大儿子逊尼被仇家杀害；小儿子麦克也被卷了进来，失去爱妻。黑手党家族之间的矛盾越来越白热化。年老的“教父”面对丧子之痛怎样统领全局？黑手党之间的仇杀如何落幕？谁是家族的内奸？谁又能够成为新一代的“教父”？血雨腥风和温情脉脉，在这部里程碑式的黑帮史诗巨片里真实上演。",
  },
  {
    screenplay: "Luciano Vincenzoni / Furio Scarpelli",
    name: "黄金三镖客",
    year: "1966",
    director: "Sergio Leone",
    desc: "意大利西部片宗师瑟吉欧·莱昂内执导的镖客电影三部曲的完结篇，由克林特．伊斯特伍德、李·范·克里夫和伊莱·沃勒克分饰英文片名所指的好人、坏人和丑恶之人。三人在美国南北战争期间趁着政局混乱，打算谋夺一批属于南方政府的财富，但每个人只知道一部分藏金的细节，必须联合起来才可以取得全部的钱，于是三人既互相利用又勾心斗角，产生不少有趣的笑料和张力十足的戏剧性对峙。本片制作严谨，气派十足，具有同类娱乐片所有吸引人的元素，主角的演出和颜尼欧莫利克奈的配乐均令人难忘。",
  },
  {
    screenplay: "Paulo Lins / Bráulio Mantovani",
    name: "上帝之城",
    year: "2002",
    director: "Fernando Meirelles",
    desc: "巴西里约热内卢的贫民窟，这里是“上帝之城”，更是魔鬼也会叹息着转身的地方。　　阿炮（Alexandre Rodrigues 饰）带着我们到了这里，他见证了这里二十多年来被残暴、贪婪、复仇、野心、背叛、掠夺所裹挟的混乱生活以及最终导致的一场灾难性的黑帮争斗。虽然从小就要辗转于匪徒间求生存，但胆小怕事的性格与自我保护的本能却使他一直能平安度日。　　60年代初，阿毛、阿夹和阿呆是这里的“少年三侠”，在抢劫完旅馆之后，他们三人分道扬镳，阿夹重回上帝的怀抱，而阿呆和阿毛纷纷付出了生命的代价。　　70年，当年“少年三侠”手下的小弟小豆子（Douglas Silva 饰）靠着自己的心狠手辣，不停地吞并别人的地盘，成为了贫民区的“小霸王”，生意也从抢劫升级到了更为暴利的毒品买卖，和他一起飞黄腾达的还有班尼（Phellipe Haagensen 饰）。　　班尼认识了美丽的安迪丽卡（Alice Braga 饰），准备归隐，在送别的晚会上，他意外被对头杀害，悲痛之下，“小霸王”集合人手给班尼报仇，帮派之间的厮杀就此开始。　　此时的阿炮，机缘巧合下成为了杂志社的见习摄影师，他的相机，照下的却是孩子们持枪核弹的狰狞，和帮派间无休无止的仇杀。",
  },

  {
    screenplay: "Winston Groom / Eric Roth",
    name: "阿甘正传",
    year: "1994",
    director: "Robert Zemeckis",
    desc: "阿甘于二战结束后不久出生在美国南方阿拉巴马州一个闭塞的小镇，他先天弱智，智商只有75，然而他的妈妈是一个性格坚强的女性，她常常鼓励阿甘“傻人有傻福”，要他自强不息。阿甘像普通孩子一样上学，并且认识了一生的朋友和至爱珍妮，在珍妮和妈妈的爱护下，阿甘凭着上帝赐予的“飞毛腿”开始了一生不停的奔跑。阿甘成为橄榄球巨星、越战英雄、乒乓球外交使者、亿万富翁，但是，他始终忘不了珍妮，几次匆匆的相聚和离别，更是加深了阿甘的思念。有一天，阿甘收到珍妮的信，他们终于又要见面…",
  },
  {
    screenplay: "Steven Zaillian / Thomas Keneally",
    name: "辛德勒的名单",
    year: "1993",
    director: "Steven Spielberg",
    desc: "1939年9月，二次世界大战方兴未艾，德军进驻波兰，将纳綷军队组成“精卫队”，下令重新安顿犹太人的户口。德商辛德勒值此战乱，一方面迎逢德军各级军官，另一方面则进行低价引进犹太劳工，并委任犹太工头以撒处理场内大小事。辛德勒虽藉机大发战争财，但对以撒却颇为仁厚而备受爱戴。“精卫队”司令阿蒙生性残暴，以枪杀劳工为乐，整个占领区如同炼狱般。1941年3月，德军将维斯图拉河以南归为犹太区，阿蒙更变本加厉，1944年4月甚至大规模展开焚尸行动，辛德勒看不惯如此行为便和以撒商议出一计，以所有资产行贿阿蒙，以捷克新厂需要大批劳工制作军火为由，列出一份长至千人的名单，运往家乡布蓝恩利兹躲藏，待德方发现时，大战结束了，辛德勒则仍以战争罪犯法办。",
  },
  {
    screenplay: "Reginald Rose",
    name: "十二怒汉",
    year: "1957",
    director: "Sidney Lumet",
    desc: "一个在平民窟中长大的男孩被指控谋杀生父，旁观者和凶器均以呈堂铁证如山。担任此案陪审团的12个人要与案件结案前在陪审团休息室里讨论案情，并要一直通过讨论结果，才能正式结案。十二个人各有自己的职业也生活，他们当中有巧舌如簧的广告商、仗义执言的工程师、毫无见地的富家子、歧视平民的新贵族、性情暴躁的老警察、精明冷静的银行家、只赶时间的推销员。每个人都有自己思考和说话的方式，但是除了亨利·方达扮演的工程师之外，其余的人都对这个案子不屑一顾，在还未进行讨论之前就早早认定男孩就是杀人凶手。最终通过了各种不同人生观的冲突，各种思维方式的较量，所有的陪审团员都负责任地投出了自己神圣的一票。",
  },
  {
    screenplay: "Agatha Christie / Harry Kurnitz",
    name: "控方证人",
    year: "1597",
    director: "Billy Wilder",
    desc: "伦敦著名邢案辩护律师韦菲爵士接受了心脏病治疗，但是身体依旧虚弱，第一天回家休养，护士一直严厉监督他服药，并杜绝烟酒。管家为了便于上楼，还专门为他修了电梯。但是，种种关心照顾，对于这位桀骜不驯、牙尖嘴利的大律师根本不起作用，反倒是一纸诉状令他倍感兴奋。律师梅休和当事人沃尔登门拜访，请他出山打官司。原来，沃尔结识了富婆，两人相见甚欢，虽然仆人对他发明的打蛋器充满鄙夷，但是富婆却对他充满爱意，甚至为他修改了遗嘱，把8万英镑留给了他。然而，富婆却惨遭毒手。于是，沃尔成为警方的头号嫌疑犯。他的唯一证人是妻子克里斯汀，然而后者登门时的冷漠与淡定，令韦菲爵士怀疑这其中另有隐情。在扑朔迷离的案件背后，隐藏着一个个环环相扣、不可告人的秘密……",
  },

  {
    screenplay: "Vincenzo Cerami",
    name: "美丽人生",
    year: "1997",
    director: "Roberto Benigni",
    desc: "犹太青年圭多（罗伯托·贝尼尼）邂逅美丽的女教师多拉（尼可莱塔·布拉斯基），他彬彬有礼的向多拉鞠躬：“早安！公主！”。历经诸多令人啼笑皆非的周折后，天遂人愿，两人幸福美满的生活在一起。然而好景不长，法西斯政权下，圭多和儿子被强行送往犹太人集中营。多拉虽没有犹太血统，毅然同行，与丈夫儿子分开关押在一个集中营里。聪明乐天的圭多哄骗儿子这只是一场游戏，奖品就是一辆大坦克，儿子快乐、天真的生活在纳粹的阴霾之中。尽管集中营的生活艰苦寂寞，圭多仍然带给他人很多快乐，他还趁机在纳粹的广播里问候妻子：“早安！公主！”法西斯政权即将倾覆，纳粹的集中营很快就要接受最后的清理，圭多编给儿子的游戏该怎么结束？他们一家能否平安的度过这黑暗的年代呢？",
  },

  {
    screenplay: "Franco Arcalli/Franco Ferrini...",
    name: "美国往事",
    year: "1984",
    director: "Sergio Leone",
    desc: "二十年代的美国，纽约少年“面条”和几个同龄朋友一起认识了聪明狡黠的“麦大”，他们开始从事走私活动。不久，面条在一场械斗中杀伤人命，被关进监牢。若干年后，“面条”出狱，当时的小伙伴们已经变成了健壮的青年人，在“麦大”的带领下，他们开始了一系列抢劫、盗窃、敲诈活动。随着犯罪活动的不断深入， “麦大”似乎被胜利冲昏了头脑，竟然把美国联邦储备银行也列入了行动目标。“面条”不忍眼看好友走向毁灭，偷偷打电话报警，想逼迫“麦大”收手。警察与 “面条”的朋友展开激烈枪战，“麦大”等人全部被杀。“面条”带着深深的悔恨和痛苦，离开纽约，回到年少时生长的地方。三十五年过去了，几近垂暮的“面条”重新回到纽约的伤心地，他遇见了少时的朋友和旧情人，而当年“麦大”他们的死，背后竟然包含着出乎意料的阴谋。",
  },
];
